phy_test/RadonDB_test_result/test_1000w/oltp_insert_32_256.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 256
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 256 tps: 64114.29 qps: 64114.29 (r/w/o: 0.00/64114.29/0.00) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 256 tps: 86837.23 qps: 86837.23 (r/w/o: 0.00/86837.23/0.00) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 256 tps: 84814.03 qps: 84814.03 (r/w/o: 0.00/84814.03/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 256 tps: 76842.86 qps: 76842.86 (r/w/o: 0.00/76842.86/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 256 tps: 52163.78 qps: 52163.78 (r/w/o: 0.00/52163.78/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 256 tps: 72369.25 qps: 72369.91 (r/w/o: 0.00/72369.91/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 256 tps: 53374.25 qps: 53373.59 (r/w/o: 0.00/53373.59/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 256 tps: 47809.54 qps: 47809.54 (r/w/o: 0.00/47809.54/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 256 tps: 32134.59 qps: 32134.59 (r/w/o: 0.00/32134.59/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 256 tps: 22917.90 qps: 22917.90 (r/w/o: 0.00/22917.90/0.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 256 tps: 26500.46 qps: 26500.46 (r/w/o: 0.00/26500.46/0.00) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 256 tps: 45420.08 qps: 45420.41 (r/w/o: 0.00/45420.41/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 256 tps: 66821.17 qps: 66821.17 (r/w/o: 0.00/66821.17/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 256 tps: 56538.70 qps: 56538.36 (r/w/o: 0.00/56538.36/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 256 tps: 72804.46 qps: 72804.46 (r/w/o: 0.00/72804.46/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 256 tps: 52727.20 qps: 52727.20 (r/w/o: 0.00/52727.20/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 256 tps: 69660.59 qps: 69660.59 (r/w/o: 0.00/69660.59/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 256 tps: 46090.28 qps: 46090.28 (r/w/o: 0.00/46090.28/0.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 256 tps: 70439.53 qps: 70439.53 (r/w/o: 0.00/70439.53/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 256 tps: 48560.83 qps: 48560.83 (r/w/o: 0.00/48560.83/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 256 tps: 51512.58 qps: 51512.58 (r/w/o: 0.00/51512.58/0.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 256 tps: 70297.40 qps: 70297.74 (r/w/o: 0.00/70297.74/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 256 tps: 43308.45 qps: 43308.45 (r/w/o: 0.00/43308.45/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 256 tps: 59835.36 qps: 59835.03 (r/w/o: 0.00/59835.03/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 256 tps: 49264.50 qps: 49264.50 (r/w/o: 0.00/49264.50/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 256 tps: 42124.43 qps: 42124.43 (r/w/o: 0.00/42124.43/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 256 tps: 48464.81 qps: 48464.81 (r/w/o: 0.00/48464.81/0.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 256 tps: 42950.11 qps: 42950.11 (r/w/o: 0.00/42950.11/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 256 tps: 42295.26 qps: 42295.26 (r/w/o: 0.00/42295.26/0.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 256 tps: 46837.83 qps: 46837.83 (r/w/o: 0.00/46837.83/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 256 tps: 39887.54 qps: 39887.54 (r/w/o: 0.00/39887.54/0.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 256 tps: 33287.61 qps: 33287.61 (r/w/o: 0.00/33287.61/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 256 tps: 55955.80 qps: 55955.80 (r/w/o: 0.00/55955.80/0.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 256 tps: 39259.58 qps: 39259.58 (r/w/o: 0.00/39259.58/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 256 tps: 47005.87 qps: 47005.87 (r/w/o: 0.00/47005.87/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 256 tps: 50185.11 qps: 50185.11 (r/w/o: 0.00/50185.11/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 256 tps: 36479.16 qps: 36479.16 (r/w/o: 0.00/36479.16/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 256 tps: 53976.71 qps: 53976.71 (r/w/o: 0.00/53976.71/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 256 tps: 36833.58 qps: 36833.58 (r/w/o: 0.00/36833.58/0.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 256 tps: 35312.25 qps: 35312.25 (r/w/o: 0.00/35312.25/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 256 tps: 19535.37 qps: 19535.37 (r/w/o: 0.00/19535.37/0.00) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 126s ] thds: 256 tps: 48145.98 qps: 48145.98 (r/w/o: 0.00/48145.98/0.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 129s ] thds: 256 tps: 39186.17 qps: 39186.17 (r/w/o: 0.00/39186.17/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 132s ] thds: 256 tps: 36928.79 qps: 36928.79 (r/w/o: 0.00/36928.79/0.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 256 tps: 50138.54 qps: 50138.54 (r/w/o: 0.00/50138.54/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 138s ] thds: 256 tps: 47126.05 qps: 47126.05 (r/w/o: 0.00/47126.05/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 141s ] thds: 256 tps: 33519.46 qps: 33519.46 (r/w/o: 0.00/33519.46/0.00) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 144s ] thds: 256 tps: 51938.31 qps: 51938.31 (r/w/o: 0.00/51938.31/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 147s ] thds: 256 tps: 37905.76 qps: 37905.76 (r/w/o: 0.00/37905.76/0.00) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 256 tps: 41751.20 qps: 41751.20 (r/w/o: 0.00/41751.20/0.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 153s ] thds: 256 tps: 42336.53 qps: 42336.53 (r/w/o: 0.00/42336.53/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 156s ] thds: 256 tps: 40407.74 qps: 40407.74 (r/w/o: 0.00/40407.74/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 159s ] thds: 256 tps: 39991.39 qps: 39991.39 (r/w/o: 0.00/39991.39/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 162s ] thds: 256 tps: 32050.58 qps: 32050.58 (r/w/o: 0.00/32050.58/0.00) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 256 tps: 34939.88 qps: 34939.88 (r/w/o: 0.00/34939.88/0.00) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 168s ] thds: 256 tps: 37042.29 qps: 37042.29 (r/w/o: 0.00/37042.29/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 171s ] thds: 256 tps: 38471.53 qps: 38471.53 (r/w/o: 0.00/38471.53/0.00) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 174s ] thds: 256 tps: 29706.17 qps: 29706.17 (r/w/o: 0.00/29706.17/0.00) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 177s ] thds: 256 tps: 29498.01 qps: 29498.35 (r/w/o: 0.00/29498.35/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 256 tps: 39349.96 qps: 39349.63 (r/w/o: 0.00/39349.63/0.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 183s ] thds: 256 tps: 33254.29 qps: 33254.29 (r/w/o: 0.00/33254.29/0.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 186s ] thds: 256 tps: 22938.44 qps: 22938.44 (r/w/o: 0.00/22938.44/0.00) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 189s ] thds: 256 tps: 35384.19 qps: 35384.53 (r/w/o: 0.00/35384.53/0.00) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 192s ] thds: 256 tps: 25422.78 qps: 25422.44 (r/w/o: 0.00/25422.44/0.00) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 256 tps: 33141.34 qps: 33141.34 (r/w/o: 0.00/33141.34/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 198s ] thds: 256 tps: 26568.12 qps: 26568.12 (r/w/o: 0.00/26568.12/0.00) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 201s ] thds: 256 tps: 23120.10 qps: 23120.10 (r/w/o: 0.00/23120.10/0.00) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 204s ] thds: 256 tps: 31655.65 qps: 31655.65 (r/w/o: 0.00/31655.65/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 207s ] thds: 256 tps: 28944.86 qps: 28944.86 (r/w/o: 0.00/28944.86/0.00) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 256 tps: 26154.20 qps: 26155.20 (r/w/o: 0.00/26155.20/0.00) lat (ms,95%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 213s ] thds: 256 tps: 31328.31 qps: 31327.31 (r/w/o: 0.00/31327.31/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 216s ] thds: 256 tps: 13194.37 qps: 13194.37 (r/w/o: 0.00/13194.37/0.00) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 219s ] thds: 256 tps: 31268.16 qps: 31268.82 (r/w/o: 0.00/31268.82/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 222s ] thds: 256 tps: 34173.13 qps: 34172.46 (r/w/o: 0.00/34172.46/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 256 tps: 25369.34 qps: 25369.34 (r/w/o: 0.00/25369.34/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 228s ] thds: 256 tps: 16484.73 qps: 16484.73 (r/w/o: 0.00/16484.73/0.00) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 231s ] thds: 256 tps: 26149.85 qps: 26149.85 (r/w/o: 0.00/26149.85/0.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           10000000
        other:                           0
        total:                           10000000
    transactions:                        10000000 (42843.47 per sec.)
    queries:                             10000000 (42843.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          233.4048s
    total number of events:              10000000

Latency (ms):
         min:                                  0.63
         avg:                                  5.97
         max:                               1411.46
         95th percentile:                     15.00
         sum:                            59717932.96

Threads fairness:
    events (avg/stddev):           39062.5000/188.65
    execution time (avg/stddev):   233.2732/0.01